In [1]:
import pandas as pd

In [2]:
sales_data = {'City': ['New York', 'New York', 'Paris', 'Paris', 'London', 'London', 'New York', 'Paris'],
              'Product': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'A'],
              'Sales': [100, 200, 150, 250, 130, 220, 170, 180]}

df_sales = pd.DataFrame(sales_data)

In [3]:
df_sales

       City Product  Sales
0  New York       A    100
1  New York       B    200
2     Paris       A    150
3     Paris       B    250
4    London       A    130
5    London       B    220
6  New York       A    170
7     Paris       A    180

##### Calculate the total and average sales per city.

In [4]:
# total sales per city
df_sales.groupby('City')['Sales'].sum()

City
London      350
New York    470
Paris       580
Name: Sales, dtype: int64

In [5]:
# average sales per city
df_sales.groupby('City')['Sales'].mean()

City
London      175.000000
New York    156.666667
Paris       193.333333
Name: Sales, dtype: float64


##### Find out which city had the highest sales for each product.

In [6]:
df_sales.groupby('Product')['City'].max()

Product
A    Paris
B    Paris
Name: City, dtype: object


##### Create a pivot table that shows total sales per city and product.

In [7]:
df_sales.pivot_table(values='Sales', index='City', aggfunc='sum')

          Sales
City
London      350
New York    470
Paris       580